---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCFileModelOptions.UserControlledInverses
source: html/bf56f77e-f0c9-be58-562f-af19fd1ceca6.htm
---
# Autodesk.Revit.DB.IFC.IFCFileModelOptions.UserControlledInverses Property

Indicates if the inverses are controlled by Revit or users. True by users, false by Revit.

## Syntax (C#)
```csharp
public bool UserControlledInverses { get; set; }
```